[
    [
        {
            "func_name": "search_class",
            "arguments": {
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "check"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "Meta.indexes"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "validate_indexes"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "_gen_cols"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "functional indexes"
            },
            "call_ok": true
        }
    ],
    []
]