[
    [
        {
            "func_name": "search_class",
            "arguments": {
                "class_name": "ItalianRestaurantManyParents"
            },
            "call_ok": false
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "ItalianRestaurant",
                "file_name": "tests/model_inheritance/models.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "Place",
                "file_name": "tests/model_inheritance/models.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "_save_parents",
                "class_name": "Model"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "create",
                "file_name": "/django/django/db/models/query.py"
            },
            "call_ok": false
        },
        {
            "func_name": "search_code_in_file",
            "arguments": {
                "code_str": "def test_create_diamond_mti_common_parents(self):",
                "file_name": "tests/model_inheritance/tests.py"
            },
            "call_ok": false
        }
    ],
    []
]