[
    {
        "rel_file_path": "django/db/models/base.py",
        "abs_file_path": "/home/kimnal0/auto-code-rover/SWE-bench/testbed/django__django/setup_django__django__5.0/django/db/models/base.py",
        "start": 903,
        "end": 945,
        "class_name": null,
        "method_name": "_save_parents",
        "code": "903     def _save_parents(self, cls, using, update_fields, updated_parents=None):\n904         \"\"\"Save all the parents of cls using values from self.\"\"\"\n905         meta = cls._meta\n906         inserted = False\n907         if updated_parents is None:\n908             updated_parents = {}\n909         for parent, field in meta.parents.items():\n910             # Make sure the link fields are synced between parent and self.\n911             if (\n912                 field\n913                 and getattr(self, parent._meta.pk.attname) is None\n914                 and getattr(self, field.attname) is not None\n915             ):\n916                 setattr(self, parent._meta.pk.attname, getattr(self, field.attname))\n917             if (parent_updated := updated_parents.get(parent)) is None:\n918                 parent_inserted = self._save_parents(\n919                     cls=parent,\n920                     using=using,\n921                     update_fields=update_fields,\n922                     updated_parents=updated_parents,\n923                 )\n924                 updated = self._save_table(\n925                     cls=parent,\n926                     using=using,\n927                     update_fields=update_fields,\n928                     force_insert=parent_inserted,\n929                 )\n930                 if not updated:\n931                     inserted = True\n932                 updated_parents[parent] = updated\n933             elif not parent_updated:\n934                 inserted = True\n935             # Set the parent's PK value to self.\n936             if field:\n937                 setattr(self, field.attname, self._get_pk_val(parent._meta))\n938                 # Since we didn't have an instance of the parent handy set\n939                 # attname directly, bypassing the descriptor. Invalidate\n940                 # the related object cache, in case it's been accidentally\n941                 # populated. A fresh instance will be re-built from the\n942                 # database if necessary.\n943                 if field.is_cached(self):\n944                     field.delete_cached_value(self)\n945         return inserted\n",
        "intended_behavior": "This method needs to ensure that when saving objects with nested multi-table inheritance, all parent objects are correctly identified and saved without errors. The `_save_parents` method should include a more robust handling mechanism for fields especially when dealing with objects that have complex inheritance chains, ensuring that fields like the `OneToOneField` used to link parent and child models in MTI setups have their attributes like `attname` correctly accessed and processed. This may involve catching exceptions where `attname` is not found and either providing a fallback method of identifying the field or ensuring that the model's meta information is fully prepared before `_save_parents` attempts to process it."
    },
    {
        "rel_file_path": "django/db/models/base.py",
        "abs_file_path": "/home/kimnal0/auto-code-rover/SWE-bench/testbed/django__django/setup_django__django__5.0/django/db/models/base.py",
        "start": 903,
        "end": 945,
        "class_name": "Model",
        "method_name": "_save_parents",
        "code": "903     def _save_parents(self, cls, using, update_fields, updated_parents=None):\n904         \"\"\"Save all the parents of cls using values from self.\"\"\"\n905         meta = cls._meta\n906         inserted = False\n907         if updated_parents is None:\n908             updated_parents = {}\n909         for parent, field in meta.parents.items():\n910             # Make sure the link fields are synced between parent and self.\n911             if (\n912                 field\n913                 and getattr(self, parent._meta.pk.attname) is None\n914                 and getattr(self, field.attname) is not None\n915             ):\n916                 setattr(self, parent._meta.pk.attname, getattr(self, field.attname))\n917             if (parent_updated := updated_parents.get(parent)) is None:\n918                 parent_inserted = self._save_parents(\n919                     cls=parent,\n920                     using=using,\n921                     update_fields=update_fields,\n922                     updated_parents=updated_parents,\n923                 )\n924                 updated = self._save_table(\n925                     cls=parent,\n926                     using=using,\n927                     update_fields=update_fields,\n928                     force_insert=parent_inserted,\n929                 )\n930                 if not updated:\n931                     inserted = True\n932                 updated_parents[parent] = updated\n933             elif not parent_updated:\n934                 inserted = True\n935             # Set the parent's PK value to self.\n936             if field:\n937                 setattr(self, field.attname, self._get_pk_val(parent._meta))\n938                 # Since we didn't have an instance of the parent handy set\n939                 # attname directly, bypassing the descriptor. Invalidate\n940                 # the related object cache, in case it's been accidentally\n941                 # populated. A fresh instance will be re-built from the\n942                 # database if necessary.\n943                 if field.is_cached(self):\n944                     field.delete_cached_value(self)\n945         return inserted\n",
        "intended_behavior": "This method needs to ensure that when saving objects with nested multi-table inheritance, all parent objects are correctly identified and saved without errors. The `_save_parents` method should include a more robust handling mechanism for fields especially when dealing with objects that have complex inheritance chains, ensuring that fields like the `OneToOneField` used to link parent and child models in MTI setups have their attributes like `attname` correctly accessed and processed. This may involve catching exceptions where `attname` is not found and either providing a fallback method of identifying the field or ensuring that the model's meta information is fully prepared before `_save_parents` attempts to process it."
    },
    {
        "rel_file_path": "django/db/models/fields/related.py",
        "abs_file_path": "/home/kimnal0/auto-code-rover/SWE-bench/testbed/django__django/setup_django__django__5.0/django/db/models/fields/related.py",
        "start": 1,
        "end": 2005,
        "class_name": null,
        "method_name": null,
        "code": "1 import functools\n2 import inspect\n3 import warnings\n4 from functools import partial\n5 \n6 from django import forms\n7 from django.apps import apps\n8 from django.conf import SettingsReference, settings\n9 from django.core import checks, exceptions\n10 from django.db import connection, router\n11 from django.db.backends import utils\n12 from django.db.models import Q\n13 from django.db.models.constants import LOOKUP_SEP\n14 from django.db.models.deletion import CASCADE, SET_DEFAULT, SET_NULL\n15 from django.db.models.query_utils import PathInfo\n16 from django.db.models.utils import make_model_tuple\n17 from django.utils.deprecation import RemovedInDjango60Warning\n18 from django.utils.functional import cached_property\n19 from django.utils.translation import gettext_lazy as _\n20 \n21 from . import Field\n22 from .mixins import FieldCacheMixin\n23 from .related_descriptors import (\n24     ForeignKeyDeferredAttribute,\n25     ForwardManyToOneDescriptor,\n26     ForwardOneToOneDescriptor,\n27     ManyToManyDescriptor,\n28     ReverseManyToOneDescriptor,\n29     ReverseOneToOneDescriptor,\n30 )\n31 from .related_lookups import (\n32     RelatedExact,\n33     RelatedGreaterThan,\n34     RelatedGreaterThanOrEqual,\n35     RelatedIn,\n36     RelatedIsNull,\n37     RelatedLessThan,\n38     RelatedLessThanOrEqual,\n39 )\n40 from .reverse_related import ForeignObjectRel, ManyToManyRel, ManyToOneRel, OneToOneRel\n41 \n42 RECURSIVE_RELATIONSHIP_CONSTANT = \"self\"\n43 \n44 \n45 def resolve_relation(scope_model, relation):\n46     \"\"\"\n47     Transform relation into a model or fully-qualified model string of the form\n48     \"app_label.ModelName\", relative to scope_model.\n49 \n50     The relation argument can be:\n51       * RECURSIVE_RELATIONSHIP_CONSTANT, i.e. the string \"self\", in which case\n52         the model argument will be returned.\n53       * A bare model name without an app_label, in which case scope_model's\n54         app_label will be prepended.\n55       * An \"app_label.ModelName\" string.\n56       * A model class, which will be returned unchanged.\n57     \"\"\"\n58     # Check for recursive relations\n59     if relation == RECURSIVE_RELATIONSHIP_CONSTANT:\n60         relation = scope_model\n61 \n62     # Look for an \"app.Model\" relation\n63     if isinstance(relation, str):\n64         if \".\" not in relation:\n65             relation = \"%s.%s\" % (scope_model._meta.app_label, relation)\n66 \n67     return relation\n68 \n69 \n70 def lazy_related_operation(function, model, *related_models, **kwargs):\n71     \"\"\"\n72     Schedule `function` to be called once `model` and all `related_models`\n73     have been imported and registered with the app registry. `function` will\n74     be called with the newly-loaded model classes as its positional arguments,\n75     plus any optional keyword arguments.\n76 \n77     The `model` argument must be a model class. Each subsequent positional\n78     argument is another model, or a reference to another model - see\n79     `resolve_relation()` for the various forms these may take. Any relative\n80     references will be resolved relative to `model`.\n81 \n82     This is a convenience wrapper for `Apps.lazy_model_operation` - the app\n83     registry model used is the one found in `model._meta.apps`.\n84     \"\"\"\n85     models = [model] + [resolve_relation(model, rel) for rel in related_models]\n86     model_keys = (make_model_tuple(m) for m in models)\n87     apps = model._meta.apps\n88     return apps.lazy_model_operation(partial(function, **kwargs), *model_keys)\n89 \n90 \n91 class RelatedField(FieldCacheMixin, Field):\n92     \"\"\"Base class that all relational fields inherit from.\"\"\"\n93 \n94     # Field flags\n95     one_to_many = False\n96     one_to_one = False\n97     many_to_many = False\n98     many_to_one = False\n99 \n100     def __init__(\n101         self,\n102         related_name=None,\n103         related_query_name=None,\n104         limit_choices_to=None,\n105         **kwargs,\n106     ):\n107         self._related_name = related_name\n108         self._related_query_name = related_query_name\n109         self._limit_choices_to = limit_choices_to\n110         super().__init__(**kwargs)\n111 \n112     @cached_property\n113     def related_model(self):\n114         # Can't cache this property until all the models are loaded.\n115         apps.check_models_ready()\n116         return self.remote_field.model\n117 \n118     def check(self, **kwargs):\n119         return [\n120             *super().check(**kwargs),\n121             *self._check_related_name_is_valid(),\n122             *self._check_related_query_name_is_valid(),\n123             *self._check_relation_model_exists(),\n124             *self._check_referencing_to_swapped_model(),\n125             *self._check_clashes(),\n126         ]\n127 \n128     def _check_related_name_is_valid(self):\n129         import keyword\n130 \n131         related_name = self.remote_field.related_name\n132         if related_name is None:\n133             return []\n134         is_valid_id = (\n135             not keyword.iskeyword(related_name) and related_name.isidentifier()\n136         )\n137         if not (is_valid_id or related_name.endswith(\"+\")):\n138             return [\n139                 checks.Error(\n140                     \"The name '%s' is invalid related_name for field %s.%s\"\n141                     % (\n142                         self.remote_field.related_name,\n143                         self.model._meta.object_name,\n144                         self.name,\n145                     ),\n146                     hint=(\n147                         \"Related name must be a valid Python identifier or end with a \"\n148                         \"'+'\"\n149                     ),\n150                     obj=self,\n151                     id=\"fields.E306\",\n152                 )\n153             ]\n154         return []\n155 \n156     def _check_related_query_name_is_valid(self):\n157         if self.remote_field.is_hidden():\n158             return []\n159         rel_query_name = self.related_query_name()\n160         errors = []\n161         if rel_query_name.endswith(\"_\"):\n162             errors.append(\n163                 checks.Error(\n164                     \"Reverse query name '%s' must not end with an underscore.\"\n165                     % rel_query_name,\n166                     hint=(\n167                         \"Add or change a related_name or related_query_name \"\n168                         \"argument for this field.\"\n169                     ),\n170                     obj=self,\n171                     id=\"fields.E308\",\n172                 )\n173             )\n174         if LOOKUP_SEP in rel_query_name:\n175             errors.append(\n176                 checks.Error(\n177                     \"Reverse query name '%s' must not contain '%s'.\"\n178                     % (rel_query_name, LOOKUP_SEP),\n179                     hint=(\n180                         \"Add or change a related_name or related_query_name \"\n181                         \"argument for this field.\"\n182                     ),\n183                     obj=self,\n184                     id=\"fields.E309\",\n185                 )\n186             )\n187         return errors\n188 \n189     def _check_relation_model_exists(self):\n190         rel_is_missing = self.remote_field.model not in self.opts.apps.get_models()\n191         rel_is_string = isinstance(self.remote_field.model, str)\n192         model_name = (\n193             self.remote_field.model\n194             if rel_is_string\n195             else self.remote_field.model._meta.object_name\n196         )\n197         if rel_is_missing and (\n198             rel_is_string or not self.remote_field.model._meta.swapped\n199         ):\n200             return [\n201                 checks.Error(\n202                     \"Field defines a relation with model '%s', which is either \"\n203                     \"not installed, or is abstract.\" % model_name,\n204                     obj=self,\n205                     id=\"fields.E300\",\n206                 )\n207             ]\n208         return []\n209 \n210     def _check_referencing_to_swapped_model(self):\n211         if (\n212             self.remote_field.model not in self.opts.apps.get_models()\n213             and not isinstance(self.remote_field.model, str)\n214             and self.remote_field.model._meta.swapped\n215         ):\n216             return [\n217                 checks.Error(\n218                     \"Field defines a relation with the model '%s', which has \"\n219                     \"been swapped out.\" % self.remote_field.model._meta.label,\n220                     hint=\"Update the relation to point at 'settings.%s'.\"\n221                     % self.remote_field.model._meta.swappable,\n222                     obj=self,\n223                     id=\"fields.E301\",\n224                 )\n225             ]\n226         return []\n227 \n228     def _check_clashes(self):\n229         \"\"\"Check accessor and reverse query name clashes.\"\"\"\n230         from django.db.models.base import ModelBase\n231 \n232         errors = []\n233         opts = self.model._meta\n234 \n235         # f.remote_field.model may be a string instead of a model. Skip if\n236         # model name is not resolved.\n237         if not isinstance(self.remote_field.model, ModelBase):\n238             return []\n239 \n240         # Consider that we are checking field `Model.foreign` and the models\n241         # are:\n242         #\n243         #     class Target(models.Model):\n244         #         model = models.IntegerField()\n245         #         model_set = models.IntegerField()\n246         #\n247         #     class Model(models.Model):\n248         #         foreign = models.ForeignKey(Target)\n249         #         m2m = models.ManyToManyField(Target)\n250 \n251         # rel_opts.object_name == \"Target\"\n252         rel_opts = self.remote_field.model._meta\n253         # If the field doesn't install a backward relation on the target model\n254         # (so `is_hidden` returns True), then there are no clashes to check\n255         # and we can skip these fields.\n256         rel_is_hidden = self.remote_field.is_hidden()\n257         rel_name = self.remote_field.get_accessor_name()  # i. e. \"model_set\"\n258         rel_query_name = self.related_query_name()  # i. e. \"model\"\n259         # i.e. \"app_label.Model.field\".\n260         field_name = \"%s.%s\" % (opts.label, self.name)\n261 \n262         # Check clashes between accessor or reverse query name of `field`\n263         # and any other field name -- i.e. accessor for Model.foreign is\n264         # model_set and it clashes with Target.model_set.\n265         potential_clashes = rel_opts.fields + rel_opts.many_to_many\n266         for clash_field in potential_clashes:\n267             # i.e. \"app_label.Target.model_set\".\n268             clash_name = \"%s.%s\" % (rel_opts.label, clash_field.name)\n269             if not rel_is_hidden and clash_field.name == rel_name:\n270                 errors.append(\n271                     checks.Error(\n272                         f\"Reverse accessor '{rel_opts.object_name}.{rel_name}' \"\n273                         f\"for '{field_name}' clashes with field name \"\n274                         f\"'{clash_name}'.\",\n275                         hint=(\n276                             \"Rename field '%s', or add/change a related_name \"\n277                             \"argument to the definition for field '%s'.\"\n278                         )\n279                         % (clash_name, field_name),\n280                         obj=self,\n281                         id=\"fields.E302\",\n282                     )\n283                 )\n284 \n285             if clash_field.name == rel_query_name:\n286                 errors.append(\n287                     checks.Error(\n288                         \"Reverse query name for '%s' clashes with field name '%s'.\"\n289                         % (field_name, clash_name),\n290                         hint=(\n291                             \"Rename field '%s', or add/change a related_name \"\n292                             \"argument to the definition for field '%s'.\"\n293                         )\n294                         % (clash_name, field_name),\n295                         obj=self,\n296                         id=\"fields.E303\",\n297                     )\n298                 )\n299 \n300         # Check clashes between accessors/reverse query names of `field` and\n301         # any other field accessor -- i. e. Model.foreign accessor clashes with\n302         # Model.m2m accessor.\n303         potential_clashes = (r for r in rel_opts.related_objects if r.field is not self)\n304         for clash_field in potential_clashes:\n305             # i.e. \"app_label.Model.m2m\".\n306             clash_name = \"%s.%s\" % (\n307                 clash_field.related_model._meta.label,\n308                 clash_field.field.name,\n309             )\n310             if not rel_is_hidden and clash_field.get_accessor_name() == rel_name:\n311                 errors.append(\n312                     checks.Error(\n313                         f\"Reverse accessor '{rel_opts.object_name}.{rel_name}' \"\n314                         f\"for '{field_name}' clashes with reverse accessor for \"\n315                         f\"'{clash_name}'.\",\n316                         hint=(\n317                             \"Add or change a related_name argument \"\n318                             \"to the definition for '%s' or '%s'.\"\n319                         )\n320                         % (field_name, clash_name),\n321                         obj=self,\n322                         id=\"fields.E304\",\n323                     )\n324                 )\n325 \n326             if clash_field.get_accessor_name() == rel_query_name:\n327                 errors.append(\n328                     checks.Error(\n329                         \"Reverse query name for '%s' clashes with reverse query name \"\n330                         \"for '%s'.\" % (field_name, clash_name),\n331                         hint=(\n332                             \"Add or change a related_name argument \"\n333                             \"to the definition for '%s' or '%s'.\"\n334                         )\n335                         % (field_name, clash_name),\n336                         obj=self,\n337                         id=\"fields.E305\",\n338                     )\n339                 )\n340 \n341         return errors\n342 \n343     def db_type(self, connection):\n344         # By default related field will not have a column as it relates to\n345         # columns from another table.\n346         return None\n347 \n348     def contribute_to_class(self, cls, name, private_only=False, **kwargs):\n349         super().contribute_to_class(cls, name, private_only=private_only, **kwargs)\n350 \n351         self.opts = cls._meta\n352 \n353         if not cls._meta.abstract:\n354             if self.remote_field.related_name:\n355                 related_name = self.remote_field.related_name\n356             else:\n357                 related_name = self.opts.default_related_name\n358             if related_name:\n359                 related_name %= {\n360                     \"class\": cls.__name__.lower(),\n361                     \"model_name\": cls._meta.model_name.lower(),\n362                     \"app_label\": cls._meta.app_label.lower(),\n363                 }\n364                 self.remote_field.related_name = related_name\n365 \n366             if self.remote_field.related_query_name:\n367                 related_query_name = self.remote_field.related_query_name % {\n368                     \"class\": cls.__name__.lower(),\n369                     \"app_label\": cls._meta.app_label.lower(),\n370                 }\n371                 self.remote_field.related_query_name = related_query_name\n372 \n373             def resolve_related_class(model, related, field):\n374                 field.remote_field.model = related\n375                 field.do_related_class(related, model)\n376 \n377             lazy_related_operation(\n378                 resolve_related_class, cls, self.remote_field.model, field=self\n379             )\n380 \n381     def deconstruct(self):\n382         name, path, args, kwargs = super().deconstruct()\n383         if self._limit_choices_to:\n384             kwargs[\"limit_choices_to\"] = self._limit_choices_to\n385         if self._related_name is not None:\n386             kwargs[\"related_name\"] = self._related_name\n387         if self._related_query_name is not None:\n388             kwargs[\"related_query_name\"] = self._related_query_name\n389         return name, path, args, kwargs\n390 \n391     def get_forward_related_filter(self, obj):\n392         \"\"\"\n393         Return the keyword arguments that when supplied to\n394         self.model.object.filter(), would select all instances related through\n395         this field to the remote obj. This is used to build the querysets\n396         returned by related descriptors. obj is an instance of\n397         self.related_field.model.\n398         \"\"\"\n399         return {\n400             \"%s__%s\" % (self.name, rh_field.name): getattr(obj, rh_field.attname)\n401             for _, rh_field in self.related_fields\n402         }\n403 \n404     def get_reverse_related_filter(self, obj):\n405         \"\"\"\n406         Complement to get_forward_related_filter(). Return the keyword\n407         arguments that when passed to self.related_field.model.object.filter()\n408         select all instances of self.related_field.model related through\n409         this field to obj. obj is an instance of self.model.\n410         \"\"\"\n411         base_q = Q.create(\n412             [\n413                 (rh_field.attname, getattr(obj, lh_field.attname))\n414                 for lh_field, rh_field in self.related_fields\n415             ]\n416         )\n417         descriptor_filter = self.get_extra_descriptor_filter(obj)\n418         if isinstance(descriptor_filter, dict):\n419             return base_q & Q(**descriptor_filter)\n420         elif descriptor_filter:\n421             return base_q & descriptor_filter\n422         return base_q\n423 \n424     @property\n425     def swappable_setting(self):\n426         \"\"\"\n427         Get the setting that this is powered from for swapping, or None\n428         if it's not swapped in / marked with swappable=False.\n429         \"\"\"\n430         if self.swappable:\n431             # Work out string form of \"to\"\n432             if isinstance(self.remote_field.model, str):\n433                 to_string = self.remote_field.model\n434             else:\n435                 to_string = self.remote_field.model._meta.label\n436             return apps.get_swappable_settings_name(to_string)\n437         return None\n438 \n439     def set_attributes_from_rel(self):\n440         self.name = self.name or (\n441             self.remote_field.model._meta.model_name\n442             + \"_\"\n443             + self.remote_field.model._meta.pk.name\n444         )\n445         if self.verbose_name is None:\n446             self.verbose_name = self.remote_field.model._meta.verbose_name\n447         self.remote_field.set_field_name()\n448 \n449     def do_related_class(self, other, cls):\n450         self.set_attributes_from_rel()\n451         self.contribute_to_related_class(other, self.remote_field)\n452 \n453     def get_limit_choices_to(self):\n454         \"\"\"\n455         Return ``limit_choices_to`` for this model field.\n456 \n457         If it is a callable, it will be invoked and the result will be\n458         returned.\n459         \"\"\"\n460         if callable(self.remote_field.limit_choices_to):\n461             return self.remote_field.limit_choices_to()\n462         return self.remote_field.limit_choices_to\n463 \n464     def formfield(self, **kwargs):\n465         \"\"\"\n466         Pass ``limit_choices_to`` to the field being constructed.\n467 \n468         Only passes it if there is a type that supports related fields.\n469         This is a similar strategy used to pass the ``queryset`` to the field\n470         being constructed.\n471         \"\"\"\n472         defaults = {}\n473         if hasattr(self.remote_field, \"get_related_field\"):\n474             # If this is a callable, do not invoke it here. Just pass\n475             # it in the defaults for when the form class will later be\n476             # instantiated.\n477             limit_choices_to = self.remote_field.limit_choices_to\n478             defaults.update(\n479                 {\n480                     \"limit_choices_to\": limit_choices_to,\n481                 }\n482             )\n483         defaults.update(kwargs)\n484         return super().formfield(**defaults)\n485 \n486     def related_query_name(self):\n487         \"\"\"\n488         Define the name that can be used to identify this related object in a\n489         table-spanning query.\n490         \"\"\"\n491         return (\n492             self.remote_field.related_query_name\n493             or self.remote_field.related_name\n494             or self.opts.model_name\n495         )\n496 \n497     @property\n498     def target_field(self):\n499         \"\"\"\n500         When filtering against this relation, return the field on the remote\n501         model against which the filtering should happen.\n502         \"\"\"\n503         target_fields = self.path_infos[-1].target_fields\n504         if len(target_fields) > 1:\n505             raise exceptions.FieldError(\n506                 \"The relation has multiple target fields, but only single target field \"\n507                 \"was asked for\"\n508             )\n509         return target_fields[0]\n510 \n511     def get_cache_name(self):\n512         return self.name\n513 \n514 \n515 class ForeignObject(RelatedField):\n516     \"\"\"\n517     Abstraction of the ForeignKey relation to support multi-column relations.\n518     \"\"\"\n519 \n520     # Field flags\n521     many_to_many = False\n522     many_to_one = True\n523     one_to_many = False\n524     one_to_one = False\n525 \n526     requires_unique_target = True\n527     related_accessor_class = ReverseManyToOneDescriptor\n528     forward_related_accessor_class = ForwardManyToOneDescriptor\n529     rel_class = ForeignObjectRel\n530 \n531     def __init__(\n532         self,\n533         to,\n534         on_delete,\n535         from_fields,\n536         to_fields,\n537         rel=None,\n538         related_name=None,\n539         related_query_name=None,\n540         limit_choices_to=None,\n541         parent_link=False,\n542         swappable=True,\n543         **kwargs,\n544     ):\n545         if rel is None:\n546             rel = self.rel_class(\n547                 self,\n548                 to,\n549                 related_name=related_name,\n550                 related_query_name=related_query_name,\n551                 limit_choices_to=limit_choices_to,\n552                 parent_link=parent_link,\n553                 on_delete=on_delete,\n554             )\n555 \n556         super().__init__(\n557             rel=rel,\n558             related_name=related_name,\n559             related_query_name=related_query_name,\n560             limit_choices_to=limit_choices_to,\n561             **kwargs,\n562         )\n563 \n564         self.from_fields = from_fields\n565         self.to_fields = to_fields\n566         self.swappable = swappable\n567 \n568     def __copy__(self):\n569         obj = super().__copy__()\n570         # Remove any cached PathInfo values.\n571         obj.__dict__.pop(\"path_infos\", None)\n572         obj.__dict__.pop(\"reverse_path_infos\", None)\n573         return obj\n574 \n575     def check(self, **kwargs):\n576         return [\n577             *super().check(**kwargs),\n578             *self._check_to_fields_exist(),\n579             *self._check_unique_target(),\n580         ]\n581 \n582     def _check_to_fields_exist(self):\n583         # Skip nonexistent models.\n584         if isinstance(self.remote_field.model, str):\n585             return []\n586 \n587         errors = []\n588         for to_field in self.to_fields:\n589             if to_field:\n590                 try:\n591                     self.remote_field.model._meta.get_field(to_field)\n592                 except exceptions.FieldDoesNotExist:\n593                     errors.append(\n594                         checks.Error(\n595                             \"The to_field '%s' doesn't exist on the related \"\n596                             \"model '%s'.\"\n597                             % (to_field, self.remote_field.model._meta.label),\n598                             obj=self,\n599                             id=\"fields.E312\",\n600                         )\n601                     )\n602         return errors\n603 \n604     def _check_unique_target(self):\n605         rel_is_string = isinstance(self.remote_field.model, str)\n606         if rel_is_string or not self.requires_unique_target:\n607             return []\n608 \n609         try:\n610             self.foreign_related_fields\n611         except exceptions.FieldDoesNotExist:\n612             return []\n613 \n614         if not self.foreign_related_fields:\n615             return []\n616 \n617         unique_foreign_fields = {\n618             frozenset([f.name])\n619             for f in self.remote_field.model._meta.get_fields()\n620             if getattr(f, \"unique\", False)\n621         }\n622         unique_foreign_fields.update(\n623             {frozenset(ut) for ut in self.remote_field.model._meta.unique_together}\n624         )\n625         unique_foreign_fields.update(\n626             {\n627                 frozenset(uc.fields)\n628                 for uc in self.remote_field.model._meta.total_unique_constraints\n629             }\n630         )\n631         foreign_fields = {f.name for f in self.foreign_related_fields}\n632         has_unique_constraint = any(u <= foreign_fields for u in unique_foreign_fields)\n633 \n634         if not has_unique_constraint and len(self.foreign_related_fields) > 1:\n635             field_combination = \", \".join(\n636                 \"'%s'\" % rel_field.name for rel_field in self.foreign_related_fields\n637             )\n638             model_name = self.remote_field.model.__name__\n639             return [\n640                 checks.Error(\n641                     \"No subset of the fields %s on model '%s' is unique.\"\n642                     % (field_combination, model_name),\n643                     hint=(\n644                         \"Mark a single field as unique=True or add a set of \"\n645                         \"fields to a unique constraint (via unique_together \"\n646                         \"or a UniqueConstraint (without condition) in the \"\n647                         \"model Meta.constraints).\"\n648                     ),\n649                     obj=self,\n650                     id=\"fields.E310\",\n651                 )\n652             ]\n653         elif not has_unique_constraint:\n654             field_name = self.foreign_related_fields[0].name\n655             model_name = self.remote_field.model.__name__\n656             return [\n657                 checks.Error(\n658                     \"'%s.%s' must be unique because it is referenced by \"\n659                     \"a foreign key.\" % (model_name, field_name),\n660                     hint=(\n661                         \"Add unique=True to this field or add a \"\n662                         \"UniqueConstraint (without condition) in the model \"\n663                         \"Meta.constraints.\"\n664                     ),\n665                     obj=self,\n666                     id=\"fields.E311\",\n667                 )\n668             ]\n669         else:\n670             return []\n671 \n672     def deconstruct(self):\n673         name, path, args, kwargs = super().deconstruct()\n674         kwargs[\"on_delete\"] = self.remote_field.on_delete\n675         kwargs[\"from_fields\"] = self.from_fields\n676         kwargs[\"to_fields\"] = self.to_fields\n677 \n678         if self.remote_field.parent_link:\n679             kwargs[\"parent_link\"] = self.remote_field.parent_link\n680         if isinstance(self.remote_field.model, str):\n681             if \".\" in self.remote_field.model:\n682                 app_label, model_name = self.remote_field.model.split(\".\")\n683                 kwargs[\"to\"] = \"%s.%s\" % (app_label, model_name.lower())\n684             else:\n685                 kwargs[\"to\"] = self.remote_field.model.lower()\n686         else:\n687             kwargs[\"to\"] = self.remote_field.model._meta.label_lower\n688         # If swappable is True, then see if we're actually pointing to the target\n689         # of a swap.\n690         swappable_setting = self.swappable_setting\n691         if swappable_setting is not None:\n692             # If it's already a settings reference, error\n693             if hasattr(kwargs[\"to\"], \"setting_name\"):\n694                 if kwargs[\"to\"].setting_name != swappable_setting:\n695                     raise ValueError(\n696                         \"Cannot deconstruct a ForeignKey pointing to a model \"\n697                         \"that is swapped in place of more than one model (%s and %s)\"\n698                         % (kwargs[\"to\"].setting_name, swappable_setting)\n699                     )\n700             # Set it\n701             kwargs[\"to\"] = SettingsReference(\n702                 kwargs[\"to\"],\n703                 swappable_setting,\n704             )\n705         return name, path, args, kwargs\n706 \n707     def resolve_related_fields(self):\n708         if not self.from_fields or len(self.from_fields) != len(self.to_fields):\n709             raise ValueError(\n710                 \"Foreign Object from and to fields must be the same non-zero length\"\n711             )\n712         if isinstance(self.remote_field.model, str):\n713             raise ValueError(\n714                 \"Related model %r cannot be resolved\" % self.remote_field.model\n715             )\n716         related_fields = []\n717         for index in range(len(self.from_fields)):\n718             from_field_name = self.from_fields[index]\n719             to_field_name = self.to_fields[index]\n720             from_field = (\n721                 self\n722                 if from_field_name == RECURSIVE_RELATIONSHIP_CONSTANT\n723                 else self.opts.get_field(from_field_name)\n724             )\n725             to_field = (\n726                 self.remote_field.model._meta.pk\n727                 if to_field_name is None\n728                 else self.remote_field.model._meta.get_field(to_field_name)\n729             )\n730             related_fields.append((from_field, to_field))\n731         return related_fields\n732 \n733     @cached_property\n734     def related_fields(self):\n735         return self.resolve_related_fields()\n736 \n737     @cached_property\n738     def reverse_related_fields(self):\n739         return [(rhs_field, lhs_field) for lhs_field, rhs_field in self.related_fields]\n740 \n741     @cached_property\n742     def local_related_fields(self):\n743         return tuple(lhs_field for lhs_field, rhs_field in self.related_fields)\n744 \n745     @cached_property\n746     def foreign_related_fields(self):\n747         return tuple(\n748             rhs_field for lhs_field, rhs_field in self.related_fields if rhs_field\n749         )\n750 \n751     def get_local_related_value(self, instance):\n752         return self.get_instance_value_for_fields(instance, self.local_related_fields)\n753 \n754     def get_foreign_related_value(self, instance):\n755         return self.get_instance_value_for_fields(instance, self.foreign_related_fields)\n756 \n757     @staticmethod\n758     def get_instance_value_for_fields(instance, fields):\n759         ret = []\n760         opts = instance._meta\n761         for field in fields:\n762             # Gotcha: in some cases (like fixture loading) a model can have\n763             # different values in parent_ptr_id and parent's id. So, use\n764             # instance.pk (that is, parent_ptr_id) when asked for instance.id.\n765             if field.primary_key:\n766                 possible_parent_link = opts.get_ancestor_link(field.model)\n767                 if (\n768                     not possible_parent_link\n769                     or possible_parent_link.primary_key\n770                     or possible_parent_link.model._meta.abstract\n771                 ):\n772                     ret.append(instance.pk)\n773                     continue\n774             ret.append(getattr(instance, field.attname))\n775         return tuple(ret)\n776 \n777     def get_attname_column(self):\n778         attname, column = super().get_attname_column()\n779         return attname, None\n780 \n781     def get_joining_columns(self, reverse_join=False):\n782         warnings.warn(\n783             \"ForeignObject.get_joining_columns() is deprecated. Use \"\n784             \"get_joining_fields() instead.\",\n785             RemovedInDjango60Warning,\n786         )\n787         source = self.reverse_related_fields if reverse_join else self.related_fields\n788         return tuple(\n789             (lhs_field.column, rhs_field.column) for lhs_field, rhs_field in source\n790         )\n791 \n792     def get_reverse_joining_columns(self):\n793         warnings.warn(\n794             \"ForeignObject.get_reverse_joining_columns() is deprecated. Use \"\n795             \"get_reverse_joining_fields() instead.\",\n796             RemovedInDjango60Warning,\n797         )\n798         return self.get_joining_columns(reverse_join=True)\n799 \n800     def get_joining_fields(self, reverse_join=False):\n801         return tuple(\n802             self.reverse_related_fields if reverse_join else self.related_fields\n803         )\n804 \n805     def get_reverse_joining_fields(self):\n806         return self.get_joining_fields(reverse_join=True)\n807 \n808     def get_extra_descriptor_filter(self, instance):\n809         \"\"\"\n810         Return an extra filter condition for related object fetching when\n811         user does 'instance.fieldname', that is the extra filter is used in\n812         the descriptor of the field.\n813 \n814         The filter should be either a dict usable in .filter(**kwargs) call or\n815         a Q-object. The condition will be ANDed together with the relation's\n816         joining columns.\n817 \n818         A parallel method is get_extra_restriction() which is used in\n819         JOIN and subquery conditions.\n820         \"\"\"\n821         return {}\n822 \n823     def get_extra_restriction(self, alias, related_alias):\n824         \"\"\"\n825         Return a pair condition used for joining and subquery pushdown. The\n826         condition is something that responds to as_sql(compiler, connection)\n827         method.\n828 \n829         Note that currently referring both the 'alias' and 'related_alias'\n830         will not work in some conditions, like subquery pushdown.\n831 \n832         A parallel method is get_extra_descriptor_filter() which is used in\n833         instance.fieldname related object fetching.\n834         \"\"\"\n835         return None\n836 \n837     def get_path_info(self, filtered_relation=None):\n838         \"\"\"Get path from this field to the related model.\"\"\"\n839         opts = self.remote_field.model._meta\n840         from_opts = self.model._meta\n841         return [\n842             PathInfo(\n843                 from_opts=from_opts,\n844                 to_opts=opts,\n845                 target_fields=self.foreign_related_fields,\n846                 join_field=self,\n847                 m2m=False,\n848                 direct=True,\n849                 filtered_relation=filtered_relation,\n850             )\n851         ]\n852 \n853     @cached_property\n854     def path_infos(self):\n855         return self.get_path_info()\n856 \n857     def get_reverse_path_info(self, filtered_relation=None):\n858         \"\"\"Get path from the related model to this field's model.\"\"\"\n859         opts = self.model._meta\n860         from_opts = self.remote_field.model._meta\n861         return [\n862             PathInfo(\n863                 from_opts=from_opts,\n864                 to_opts=opts,\n865                 target_fields=(opts.pk,),\n866                 join_field=self.remote_field,\n867                 m2m=not self.unique,\n868                 direct=False,\n869                 filtered_relation=filtered_relation,\n870             )\n871         ]\n872 \n873     @cached_property\n874     def reverse_path_infos(self):\n875         return self.get_reverse_path_info()\n876 \n877     @classmethod\n878     @functools.cache\n879     def get_class_lookups(cls):\n880         bases = inspect.getmro(cls)\n881         bases = bases[: bases.index(ForeignObject) + 1]\n882         class_lookups = [parent.__dict__.get(\"class_lookups\", {}) for parent in bases]\n883         return cls.merge_dicts(class_lookups)\n884 \n885     def contribute_to_class(self, cls, name, private_only=False, **kwargs):\n886         super().contribute_to_class(cls, name, private_only=private_only, **kwargs)\n887         setattr(cls, self.name, self.forward_related_accessor_class(self))\n888 \n889     def contribute_to_related_class(self, cls, related):\n890         # Internal FK's - i.e., those with a related name ending with '+' -\n891         # and swapped models don't get a related descriptor.\n892         if (\n893             not self.remote_field.is_hidden()\n894             and not related.related_model._meta.swapped\n895         ):\n896             setattr(\n897                 cls._meta.concrete_model,\n898                 related.get_accessor_name(),\n899                 self.related_accessor_class(related),\n900             )\n901             # While 'limit_choices_to' might be a callable, simply pass\n902             # it along for later - this is too early because it's still\n903             # model load time.\n904             if self.remote_field.limit_choices_to:\n905                 cls._meta.related_fkey_lookups.append(\n906                     self.remote_field.limit_choices_to\n907                 )\n908 \n909 \n910 ForeignObject.register_lookup(RelatedIn)\n911 ForeignObject.register_lookup(RelatedExact)\n912 ForeignObject.register_lookup(RelatedLessThan)\n913 ForeignObject.register_lookup(RelatedGreaterThan)\n914 ForeignObject.register_lookup(RelatedGreaterThanOrEqual)\n915 ForeignObject.register_lookup(RelatedLessThanOrEqual)\n916 ForeignObject.register_lookup(RelatedIsNull)\n917 \n918 \n919 class ForeignKey(ForeignObject):\n920     \"\"\"\n921     Provide a many-to-one relation by adding a column to the local model\n922     to hold the remote value.\n923 \n924     By default ForeignKey will target the pk of the remote model but this\n925     behavior can be changed by using the ``to_field`` argument.\n926     \"\"\"\n927 \n928     descriptor_class = ForeignKeyDeferredAttribute\n929     # Field flags\n930     many_to_many = False\n931     many_to_one = True\n932     one_to_many = False\n933     one_to_one = False\n934 \n935     rel_class = ManyToOneRel\n936 \n937     empty_strings_allowed = False\n938     default_error_messages = {\n939         \"invalid\": _(\"%(model)s instance with %(field)s %(value)r does not exist.\")\n940     }\n941     description = _(\"Foreign Key (type determined by related field)\")\n942 \n943     def __init__(\n944         self,\n945         to,\n946         on_delete,\n947         related_name=None,\n948         related_query_name=None,\n949         limit_choices_to=None,\n950         parent_link=False,\n951         to_field=None,\n952         db_constraint=True,\n953         **kwargs,\n954     ):\n955         try:\n956             to._meta.model_name\n957         except AttributeError:\n958             if not isinstance(to, str):\n959                 raise TypeError(\n960                     \"%s(%r) is invalid. First parameter to ForeignKey must be \"\n961                     \"either a model, a model name, or the string %r\"\n962                     % (\n963                         self.__class__.__name__,\n964                         to,\n965                         RECURSIVE_RELATIONSHIP_CONSTANT,\n966                     )\n967                 )\n968         else:\n969             # For backwards compatibility purposes, we need to *try* and set\n970             # the to_field during FK construction. It won't be guaranteed to\n971             # be correct until contribute_to_class is called. Refs #12190.\n972             to_field = to_field or (to._meta.pk and to._meta.pk.name)\n973         if not callable(on_delete):\n974             raise TypeError(\"on_delete must be callable.\")\n975 \n976         kwargs[\"rel\"] = self.rel_class(\n977             self,\n978             to,\n979             to_field,\n980             related_name=related_name,\n981             related_query_name=related_query_name,\n982             limit_choices_to=limit_choices_to,\n983             parent_link=parent_link,\n984             on_delete=on_delete,\n985         )\n986         kwargs.setdefault(\"db_index\", True)\n987 \n988         super().__init__(\n989             to,\n990             on_delete,\n991             related_name=related_name,\n992             related_query_name=related_query_name,\n993             limit_choices_to=limit_choices_to,\n994             from_fields=[RECURSIVE_RELATIONSHIP_CONSTANT],\n995             to_fields=[to_field],\n996             **kwargs,\n997         )\n998         self.db_constraint = db_constraint\n999 \n1000     def __class_getitem__(cls, *args, **kwargs):\n1001         return cls\n1002 \n1003     def check(self, **kwargs):\n1004         return [\n1005             *super().check(**kwargs),\n1006             *self._check_on_delete(),\n1007             *self._check_unique(),\n1008         ]\n1009 \n1010     def _check_on_delete(self):\n1011         on_delete = getattr(self.remote_field, \"on_delete\", None)\n1012         if on_delete == SET_NULL and not self.null:\n1013             return [\n1014                 checks.Error(\n1015                     \"Field specifies on_delete=SET_NULL, but cannot be null.\",\n1016                     hint=(\n1017                         \"Set null=True argument on the field, or change the on_delete \"\n1018                         