[
    [
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "index_together"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "class Meta"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "indexes ="
            },
            "call_ok": true
        },
        {
            "func_name": "search_class",
            "arguments": {
                "class_name": "Index"
            },
            "call_ok": true
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "get_indexes",
                "class_name": "Model"
            },
            "call_ok": false
        },
        {
            "func_name": "search_method_in_class",
            "arguments": {
                "method_name": "add_index",
                "class_name": "Model"
            },
            "call_ok": false
        }
    ],
    []
]